src/Catalogs/ИсточникиДанных/ИсточникиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникиДанных</name>
  <predefined>
    <items>
      <name>WebСервисНСИ</name>
      <description>Web сервис НСИ</description>
    </items>
    <items>
      <name>АдресВзаимодействияСПорталомЗаказчика</name>
      <description>Адрес взаимодействия с порталом заказчика</description>
    </items>
    <items>
      <name>ПодключениеКТекущейСУБД</name>
      <description>Подключение к текущей СУБД</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСоединения</name>
    <type>
      <types>EnumRef.ТипыСоединенияИсточникаДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаWebСервис</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>750</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыСоединенияИсточникаДанных/ТипыСоединенияИсточникаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСоединенияИсточникаДанных</name>
  <enumValues>
    <name>MSSQLConnection</name>
  </enumValues>
  <enumValues>
    <name>WebСервис</name>
  </enumValues>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИсточникиДанных/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
	
		ПоказатьПредупреждение(, "Перед проверкой подключения объект необходимо записать.",, "Действие запрещено");
		Возврат;
	
	КонецЕсли;
	
	ПоказатьПредупреждение(, ПроверитьСоединениеНаСервере(),, "Результат проверки");
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСоединениеНаСервере()

	Если Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.MSSQLConnection Тогда
	
		Соединение = РаботаСMSSQL.УстановитьСоединение(Объект.Ссылка);
	
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
	
		Возврат "Не удалось установить соединение. Подродности в информации об ошибках.";
		
	Иначе
		
		Соединение.Close();
		Возврат "Соединение успешно установлено.";
	
	КонецЕсли;

КонецФункции // ПроверитьСоединениеНаСервере()

&НаСервере
Процедура ИзменитьВидимостьЭлементов()
	
	Если Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.MSSQLConnection Тогда
		Элементы.ЭлектроннаяПочта.Видимость = Ложь;
		Элементы.MSSQL.Видимость = Истина;
		Элементы.WebСервис.Видимость = Ложь;
	ИначеЕсли Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.WebСервис Тогда
		Элементы.ЭлектроннаяПочта.Видимость = Ложь;
		Элементы.MSSQL.Видимость = Ложь;
		Элементы.WebСервис.Видимость = Истина;
	ИначеЕсли Объект.ТипСоединения = Перечисления.ТипыСоединенияИсточникаДанных.ЭлектроннаяПочта Тогда
		Элементы.ЭлектроннаяПочта.Видимость = Истина;
		Элементы.MSSQL.Видимость = Ложь;
		Элементы.WebСервис.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗначения()
	
	Объект.Наименование = "";
	Объект.ИмяСервера = "";
	Объект.ИмяБазы = "";
	Объект.Пользователь = "";
	Объект.Пароль = "";
	Объект.СсылкаНаWebСервис = "";
	Объект.КодАбонента = "";
	
КонецПроцедуры
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьВидимостьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ТипСоединенияПриИзменении(Элемент)
	
	ОчиститьЗначения();
	
	ИзменитьВидимостьЭлементов();
	
КонецПроцедуры
